{
  "backend/main.mo": "Defines cemetery domain types, public views, content types, and comparison helpers within a Motoko actor for managing graves, deceased persons, and site content.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing their purpose and key UI or logic changes.",
  "frontend/index.css": "Defines Tailwind CSS base layers and custom light/dark theme variables for global styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React application and loads the main entry script.",
  "frontend/src/App.tsx": "Main React application wrapper handling authentication, profile setup, routing between public/admin pages, connection status, and theme/query providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-denied message for non-authorized users with a logout action clearing identity and query cache.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Admin interactive cemetery map showing graves by status and allowing grave selection for editing.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Admin interface for managing cemetery alleys and graves, including adding and removing entries.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing grave records, including deceased persons, owner data, and status.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin grave listing with incremental loading, search filtering, and the ability to open a create/edit dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading, converting, and resizing images using canvas.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "React component for selecting, previewing, resizing, and uploading images with progress tracking.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a PDF of cemetery grave records using fetched data and dynamic HTML content.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin UI for editing site content sections, including hero, footer, prayers, cemetery info, and images.",
  "frontend/src/components/ConnectionStatus.tsx": "Shows connectivity status using backend health checks and provides a retry mechanism when the server is unreachable.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating button enabling unauthenticated users to initiate Internet Identity login with simple error handling.",
  "frontend/src/components/Footer.tsx": "Renders the footer with contact info, office hours, bank details, and a link, using fetched content with fallbacks. Shows errors and loading states and includes copyright info.",
  "frontend/src/components/GraveResultsList.tsx": "Displays a paginated list of grave results for admins or public users with status badges, load-more logic, and optional editing dialog. Handles empty states and formats visible fields.",
  "frontend/src/components/GraveSearch.tsx": "Implements admin and public grave search with debounced text filtering, paginated loading for admins, and full‑text search indices. Renders loading states and passes filtered results to the results list.",
  "frontend/src/components/GraveTileMap.tsx": "Displays a cemetery map with alley sections and grave tile statuses, using fetched tile and layout data. Includes a status legend and lazy mounting for performance.",
  "frontend/src/components/Header.tsx": "Renders the site header with logo, theme toggle, and optional logout button. Uses site content for a dynamic logo and handles theme switching and authentication state.",
  "frontend/src/components/HeroSection.tsx": "Shows a hero section with dynamic background, headline, and intro text fetched from site content with fallbacks. Handles loading and error states with skeletons and banners.",
  "frontend/src/components/LazyMount.tsx": "Provides a wrapper that mounts children only when near the viewport using an intersection observer. Useful for heavy components like large grids or maps.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form allowing users to enter and save their name and optional email using a profile‑save mutation.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Grid of selectable public section tiles that triggers a callback with the chosen section ID.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Alert banner component displaying a fallback message when site content fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating related queries on change.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Performs periodic backend health checks using the actor and exposes connection status.",
  "frontend/src/hooks/useDebouncedValue.ts": "Hook that returns a debounced version of a changing value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity loading.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to detect when an element enters the viewport.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks with caching, retry logic, and error handling for fetching and mutating cemetery-related data.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables with smooth transition rules.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin interface with tabbed navigation and lazy‑loaded management components.",
  "frontend/src/pages/PublicPage.tsx": "Implements the public-facing page with hero content, section tiles, tabbed search/map views, and scroll-to-section behavior.",
  "frontend/src/utils/authErrors.ts": "Utility functions for detecting authorization and connectivity errors based on error message text.",
  "frontend/src/utils/graveFullTextSearch.ts": "Implements text normalization, search index builders, and in-memory full‑text search for graves in admin and public modes.",
  "frontend/src/utils/graveStatusStyles.ts": "Provides functions that map grave status values to Tailwind-based style objects, labels, legend colors, and badge variants.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, container settings, animations, shadows, and CSS variables for the app.",
  "project_state.json": "Project metadata describing state, issues, and existing feature requirements for the Cemetery Portal."
}