{
  "backend/main.mo": "Main Motoko actor defining cemetery management types (GraveRecord, DeceasedPerson, GraveOwner, GraveStatus, SiteContent) and modules for comparison/filtering logic, integrating authorization, blob storage, and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: grave detail card component with click-to-open functionality, color-coded payment status display, and preserved hover tooltip behavior on grave tiles.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App, hooks, pages, and admin panels, describing UI enhancements, query logic, grave management, and cemetery layout functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title for the Cemetery Record Management System for Parafia św. Jana Chrzciciela w Zbroszy Dużej.",
  "frontend/publish-live.build64.txt": "Build marker file (Build 64) used to trigger Live deployment via CI/CD pipeline with no functional changes.",
  "frontend/redeploy-trigger.build63.txt": "Operational redeploy trigger file (Build 63) to force CI/CD pipeline execution following a deployment error, containing no functional changes.",
  "frontend/redeploy-trigger.build64.txt": "Operational redeploy trigger file (Build 64) to force new CI/CD build artifact generation with no application logic or behavioral changes.",
  "frontend/src/App.tsx": "Main React application component with QueryClient setup, authentication flow, actor initialization with retry logic and timeout handling, profile setup modal, and conditional rendering of PublicPage or AdminPanel based on authorization.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield icon, explanatory message, and logout button for authenticated but unauthorized users attempting to access admin-locked features.",
  "frontend/src/components/ActorInitializationErrorScreen.tsx": "Error screen component shown when actor initialization fails, providing retry button with loading state and troubleshooting suggestions for network/server connection issues.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Interactive cemetery map visualization for admins showing all graves organized by alleys with color-coded status indicators. Clicking a grave opens an edit dialog.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Admin interface for managing cemetery structure, allowing creation and deletion of alleys and graves with confirmation dialogs and loading states.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog component for creating new graves or editing existing grave records, including alley, plot number, status, deceased persons, owner, and payment validity date. Handles form state, validation, and submission via mutation hooks.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin interface for managing graves with infinite scroll pagination, client-side full-text search using debounced input, and lazy-loaded create/edit dialog. Displays filtered grave results and load-more functionality.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for image manipulation including loading images, converting files to data URLs, and resizing images to fit within max dimensions while maintaining aspect ratio.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Image upload component that handles file selection, client-side resizing to specified dimensions, preview display, and saving as ExternalBlob with upload progress tracking. Supports removing existing images.",
  "frontend/src/components/admin/ManagerDelegation.tsx": "Boss-only component for managing delegated manager access rights. Allows adding and removing manager principals, displays current boss and manager list, with validation to prevent duplicates or adding the boss as manager.",
  "frontend/src/components/admin/PDFExport.tsx": "Component for generating and exporting a PDF report of all cemetery graves organized by alley, including deceased persons, owners, status, and payment validity. Creates formatted HTML content for PDF generation.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin component for managing site content including hero section, parish footer, prayer sections, and cemetery information with image upload capabilities and form state management.",
  "frontend/src/components/ConnectionStatus.tsx": "Displays connection status alerts for backend health checks with retry functionality, showing loading, disconnected, or actor error states.",
  "frontend/src/components/FloatingLoginControl.tsx": "Renders a fixed floating button in the bottom-right corner that triggers Internet Identity login.",
  "frontend/src/components/Footer.tsx": "Displays parish footer with contact info, mass times, social media links, bank account with copy functionality, and decorative parchment background.",
  "frontend/src/components/GraveDetailCard.tsx": "Modal dialog showing detailed grave information including location, status, deceased persons, and payment messages with status-based styling.",
  "frontend/src/components/GraveResultsList.tsx": "Renders paginated list of grave search results with load-more functionality, supporting both admin (full records) and public (limited) views.",
  "frontend/src/components/GraveSearch.tsx": "Search interface with debounced full-text filtering over graves, supporting both admin paginated queries and public grave results with in-memory search.",
  "frontend/src/components/GraveTileMap.tsx": "Displays cemetery map organized by alleys with clickable grave tiles, status legend, and lazy-mounted alley sections for performance.",
  "frontend/src/components/Header.tsx": "Header component displaying parish logo, name, theme toggle button, and logout button for authenticated users. Fetches and displays custom logo from site content if available.",
  "frontend/src/components/HeroSection.tsx": "Hero section component showing a customizable background image, headline, and intro paragraph fetched from site content with fallback defaults. Displays a Bible verse and handles loading/error states.",
  "frontend/src/components/LazyMount.tsx": "Wrapper component that defers mounting children until they are near the viewport using intersection observer. Useful for performance optimization of heavy content.",
  "frontend/src/components/PrivatePreviewBanner.tsx": "Alert banner component that displays a warning message indicating the app is running in Private Preview Mode for internal testing only.",
  "frontend/src/components/PrivatePreviewGate.tsx": "Gate component that blocks unauthenticated users from accessing content in Private Preview Mode and prompts them to log in via Internet Identity.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name (required) and email (optional) with form validation and submission handling.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Grid of four interactive tile buttons (Map, Search, Prayer, About) that navigate to different sections of the public cemetery interface.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Reusable alert banner component that displays a warning when site content fails to load, with customizable error message.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling both anonymous and authenticated identities and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Hook that checks if the authenticated user has admin access (boss or manager role) by querying the backend access role.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Hook that periodically checks backend connectivity via health check endpoint and provides connection status with manual recheck capability.",
  "frontend/src/hooks/useDebouncedValue.ts": "Generic hook that debounces a value by delaying updates until after a specified delay period (default 300ms).",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and auth client lifecycle.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to detect when an element enters the viewport with configurable threshold, root margin, and trigger-once options.",
  "frontend/src/hooks/usePrivatePreviewMode.ts": "Hook that manages private preview mode state via URL hash parameters, persisting the state in sessionStorage for the browser session.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of React Query hooks for all backend operations including grave records, user profiles, site content, manager delegation, and cemetery data with error handling and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, including sidebar, tile, and chart color schemes. Defines global transitions for smooth theme switching.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabbed interface for managing graves, cemetery layout, search, PDF export, site content, and manager delegation. Uses lazy loading for performance and checks admin authorization.",
  "frontend/src/pages/PublicPage.tsx": "Public-facing page with hero section, navigation tiles, and tabbed interface for grave search and cemetery map. Includes sections for prayer content and cemetery information with smooth scrolling.",
  "frontend/src/utils/authErrors.ts": "Utility functions to detect and categorize backend authorization errors, including Boss-only actions, manager access, connectivity issues, and access control initialization errors.",
  "frontend/src/utils/graveFullTextSearch.ts": "In-memory full-text search utilities for grave records with separate functions for admin mode (all fields) and public mode (deceased names and year only). Supports early exit with maxResults.",
  "frontend/src/utils/graveStatusStyles.ts": "Shared styling utilities for grave status visualization, providing consistent colors, hover effects, badges, and text styles for paid, unpaid, reserved, and free grave statuses across light/dark themes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (using OKLCH), container settings, border radius variables, and keyframe animations for the application.",
  "project_state.json": "Project state tracking file for Cemetery Manager application, documenting existing features for grave card display with payment status indicators and architectural notes about modal/overlay implementation."
}