{
  "backend/main.mo": "Defines the actor, cemetery data models, public and admin types, and comparison utilities for grave and deceased records, including extended site content fields.",
  "backend/migration.mo": "Provides migration logic converting old site content to the new format by adding the searchDisclaimer HTML section.",
  "feature_evidence.json": "Describes feature evidence linking publishing Draft Version 26 to related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for build documentation and reference.",
  "frontend/docs/publish-draft-v26-preview.md": "Documentation explaining how to publish Draft Version 26 as the active preview build and verify deployment.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode overrides, and base styling tokens.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, layout, theme, lazy loading of public/admin pages, and profile setup gating.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Shows an interactive admin map of cemetery graves with status coloring and supports opening a grave edit dialog.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Provides UI for adding and removing alleys and graves in the cemetery layout using query mutation hooks.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing a grave, including status, owner, deceased persons, and payment fields.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin interface for searching, listing, paginating, and creating graves with an optional edit dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading images, converting files to data URLs, and resizing images into Uint8Array blobs.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Handles image selection, validation, preview, resizing, and upload with progress tracking for admin image updates.",
  "frontend/src/components/admin/PDFExport.tsx": "Component that generates a cemetery PDF by building HTML from grave and cemetery data, with status formatting and a generation button.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin UI for editing site content including hero, footer, prayer, and cemetery sections, with image upload and update mutations.",
  "frontend/src/components/ConnectionStatus.tsx": "Displays connection status or warnings based on actor availability and network readiness.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating login button for administrators using Internet Identity with tooltip and disabled state handling.",
  "frontend/src/components/Footer.tsx": "Displays footer content with contact details, fallback data, and a site credit, handling loading and error states.",
  "frontend/src/components/GraveResultsList.tsx": "Renders public or admin grave search results with status badges and optional editing for admins.",
  "frontend/src/components/GraveSearch.tsx": "Provides grave search with in‑memory filtering, loading state handling, and separate logic for admin and public views.",
  "frontend/src/components/GraveTileMap.tsx": "Shows a cemetery tile map with status‑colored grave tiles and a legend, using fetched cemetery layout and tile data.",
  "frontend/src/components/Header.tsx": "Renders the site header with logo, theme toggle, and optional logout based on authentication state.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with dynamic background, title, scripture quote, and introductory text, with loading and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for initial user profile setup, allowing name and optional email submission with validation and status feedback.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Renders selectable public section tiles with icons and labels, invoking a callback when a tile is clicked.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Displays an alert banner indicating site content loading errors with an optional custom message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor tied to Internet Identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity authentication, login state, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks and retry logic for fetching and mutating backend cemetery, graves, user, and site content data.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling for the frontend.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPanel.tsx": "Renders an admin dashboard with tabbed sections loading various management components via React.lazy.",
  "frontend/src/pages/PublicPage.tsx": "Displays the public-facing site with search, map, and optional prayer/about sections, using lazy-loaded components.",
  "frontend/src/utils/graveFullTextSearch.ts": "Provides in-memory text search utilities for graves in admin and public modes with differing searchable fields.",
  "frontend/src/utils/graveStatusStyles.ts": "Defines styling helpers and labels for grave status values such as paid, unpaid, reserved, and free.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and sessionStorage parameters with hash routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS, extending theme colors, containers, animations, and typography plugins.",
  "project_state.json": "Contains project metadata including versioning, notes, known issues, and existing feature requests."
}