{
  "backend/main.mo": "Defines core cemetery data types, public result shapes, and comparison helpers for graves and deceased persons.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for many frontend source files used for build planning.",
  "frontend/index.css": "Tailwind base/theme configuration defining light/dark CSS variables and global styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React app handling authentication, theme, routing between public/admin views, and profile setup logic.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a non‑authorized user logs in, offering logout.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Shows an interactive cemetery map with grave status coloring and opens an edit dialog when a grave is selected.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Provides UI to add and remove alleys and graves within the cemetery layout, including confirmation dialogs.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Modal dialog for creating or editing grave records, including status, deceased persons, owner, and payment data.",
  "frontend/src/components/admin/GraveManagement.tsx": "Displays searchable, paginated grave records and allows creating new graves via a lazily loaded edit dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading, converting, and resizing images, returning processed data as Uint8Array.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Handles image uploading, previewing, resizing, and saving with progress tracking and optional removal.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a styled cemetery registry PDF using grave and cemetery data with HTML templates and triggers file download.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin UI for editing site content sections, handling text updates and image uploads via backend mutations.",
  "frontend/src/components/ConnectionStatus.tsx": "Displays backend connectivity status with warnings after timeout.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating login button for unauthenticated users with Internet Identity handling.",
  "frontend/src/components/Footer.tsx": "Displays contact info, banking details, and website link using fetched footer content with fallbacks and error banner.",
  "frontend/src/components/GraveResultsList.tsx": "Renders paginated grave search results for public and admin views with status badges and optional editing.",
  "frontend/src/components/GraveSearch.tsx": "Provides admin and public grave search with debounced filtering, paginated loading, and full‑text search indices.",
  "frontend/src/components/GraveTileMap.tsx": "Shows an interactive cemetery map with alleys and grave tiles, using tile data and status-based coloring.",
  "frontend/src/components/Header.tsx": "Displays site header with logo, parish name, theme toggle, and optional logout for authenticated users.",
  "frontend/src/components/HeroSection.tsx": "Shows homepage hero image, headline, and intro text with loading skeletons and fallback content.",
  "frontend/src/components/LazyMount.tsx": "Utility that mounts children only when near viewport to optimize heavy content rendering.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving user profile data with validation and feedback messages.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Renders a grid of selectable public section tiles with icons and labels, triggering onSelect when clicked.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Displays an alert banner showing a customizable site‑content loading error message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value that updates after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, providing identity, login/clear actions, and status tracking through context.",
  "frontend/src/hooks/useInView.ts": "Tracks whether an element is in the viewport using IntersectionObserver, with optional one-time trigger.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for backend operations with caching, retry logic, and error handling for graves, content, and user data.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/AdminPanel.tsx": "Admin interface with tabbed navigation loading various management components lazily.",
  "frontend/src/pages/PublicPage.tsx": "Public page with hero section, tile navigation, lazy-loaded search/map tabs, and optional prayer/about sections.",
  "frontend/src/utils/authErrors.ts": "Utilities for detecting specific authorization errors such as Boss-lock and general unauthorized states.",
  "frontend/src/utils/graveFullTextSearch.ts": "Provides text normalization and in-memory full‑text search utilities for graves in admin and public modes.",
  "frontend/src/utils/graveStatusStyles.ts": "Maps grave statuses to consistent CSS classes and labels for UI styling.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content scanning, extended color tokens, layout settings, and custom keyframes.",
  "project_state.json": "Tracks project state for a grave management app, listing features, issues, and pending requests related to enhancing search result details."
}