{
  "backend/main.mo": "Main Motoko actor defining cemetery management types (GraveRecord, DeceasedPerson, GraveOwner, GraveStatus), public/admin data shapes, cemetery state with alleys, user profiles, site content structures, and comparison functions for sorting grave records by alley/plot or deceased person's last name.",
  "feature_evidence.json": "Feature evidence report documenting the removal of duplicate close button from GraveDetailCard modal, targeting frontend/src/components/GraveDetailCard.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing improved UI spacing, typography, error handling, query hooks, admin features including manager delegation, lazy loading, and public/admin grave search with detail card functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, card, primary, secondary, muted, accent, destructive, border, input, ring, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with Polish parish title (Parafia św. Jana Chrzciciela w Zbroszy Dużej) and root div mounting the React application via main.tsx.",
  "frontend/publish-live.build64.txt": "Build 64 deployment trigger marker file with no functional changes, used solely to trigger Live deployment via CI/CD pipeline.",
  "frontend/redeploy-trigger.build63.txt": "Build 63 operational redeploy trigger file created to force new CI/build artifact after deployment error, containing no functional changes.",
  "frontend/redeploy-trigger.build64.txt": "Build 64 operational redeploy trigger file for CI/CD pipeline with no application logic or behavioral changes.",
  "frontend/src/App.tsx": "Main React app with QueryClient setup, authentication flow, actor initialization with 10-second timeout and retry mechanism, profile setup modal, private preview gating, admin authorization checks, and lazy-loaded routing between public page and admin panel.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen for unauthorized users attempting admin access, displaying shield icon, explanation message, and logout button that clears identity and query cache.",
  "frontend/src/components/ActorInitializationErrorScreen.tsx": "Error screen displayed when actor initialization fails, showing alert with retry button and troubleshooting suggestions (refresh page, check connection, try different browser, clear cache).",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Displays an interactive cemetery map with clickable grave tiles color-coded by status, allowing admins to view and edit grave records via dialog.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Admin interface for managing cemetery structure by adding/removing alleys and graves, with confirmation dialogs for deletions and loading states.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Modal dialog for creating new graves or editing existing ones, including fields for location, status, payment dates, deceased persons, and owner information.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin component for managing cemetery graves with infinite scroll pagination, client-side full-text search using debounced input, and lazy-loaded create/edit dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for image processing including loading images, converting files to data URLs, and resizing images to fit max dimensions while maintaining aspect ratio.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Reusable image upload component that handles file selection, preview, resizing to specified dimensions, upload progress tracking, and saving/removing images as ExternalBlob.",
  "frontend/src/components/admin/ManagerDelegation.tsx": "Boss-only component for managing delegated manager rights, allowing the owner to grant and revoke management access to other principals by Principal ID.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a printable PDF report of all cemetery graves organized by alley, including deceased persons, owners, payment status, and expiration dates.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin interface for editing site-wide content including hero section, parish footer details, prayer texts, cemetery information, and logo/background images.",
  "frontend/src/components/ConnectionStatus.tsx": "Connection status banner component displaying checking/disconnected states with retry button, using backend health check hook to detect actor errors and network issues.",
  "frontend/src/components/FloatingLoginControl.tsx": "Fixed-position floating login button in bottom-right corner with icon, disabled during login process, triggering Internet Identity authentication flow.",
  "frontend/src/components/Footer.tsx": "Renders a footer component displaying parish information (name, address, mass times, contact details, bank account with copy functionality), social media links, and a developer credit section. Fetches footer content via useGetParishFooterContent hook and includes decorative background styling.",
  "frontend/src/components/GraveDetailCard.tsx": "Displays a modal dialog with detailed information about a grave including location (alley, plot number), payment status, deceased persons list, and contact information. Supports both PublicTileData and PublicGraveResult types with status-based styling and formatting.",
  "frontend/src/components/GraveResultsList.tsx": "Renders a paginated list of grave search results with load-more functionality, supporting both admin (GraveRecord) and public (PublicGraveResult) views. Displays grave details in cards with status badges, deceased information, and click handlers for editing (admin) or viewing details (public).",
  "frontend/src/components/GraveSearch.tsx": "Provides a search interface for graves with debounced full-text search across all grave fields using precomputed search indices. Supports both admin mode (infinite pagination) and public mode (all results), with in-memory filtering and load-more functionality.",
  "frontend/src/components/GraveTileMap.tsx": "Renders an interactive cemetery map organized by alleys, displaying graves as colored tiles based on payment status with tooltips and click-to-view-details functionality. Includes a status legend and uses lazy mounting for performance optimization.",
  "frontend/src/components/Header.tsx": "Displays the site header with parish logo (custom or fallback), title, theme toggle button, and logout button for authenticated users. Fetches site content for custom logo and uses Internet Identity for authentication state.",
  "frontend/src/components/HeroSection.tsx": "Displays the homepage hero section with a background image, headline, Bible verse, and intro paragraph, all fetched from site content with loading skeletons and error handling.",
  "frontend/src/components/LazyMount.tsx": "A component that defers mounting its children until they are near the viewport using intersection observer, useful for performance optimization of heavy content.",
  "frontend/src/components/PrivatePreviewBanner.tsx": "Displays an alert banner at the top of the app indicating that it's running in Private Preview Mode for internal testing only.",
  "frontend/src/components/PrivatePreviewGate.tsx": "Blocks access to public content in Private Preview Mode for unauthenticated users, showing a login prompt with Internet Identity authentication.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and optional email to complete their profile setup, with form validation and submission handling.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Renders a grid of four interactive tiles (map, search, prayer, about) that navigate to different sections of the public cemetery interface.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Displays a warning alert banner when site content fails to load, informing users that default information is being shown instead.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Checks if the authenticated user has admin privileges (boss or manager role) by querying the backend actor's getAccessRole method.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Periodically checks backend connectivity via healthCheck calls, returning connection status and providing a recheck function that invalidates the actor and retries.",
  "frontend/src/hooks/useDebouncedValue.ts": "Debounces a value by delaying updates until after a specified delay (default 300ms) using setTimeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity state management, and persistent session handling using AuthClient.",
  "frontend/src/hooks/useInView.ts": "Detects when an element enters the viewport using IntersectionObserver with configurable threshold, rootMargin, and triggerOnce options.",
  "frontend/src/hooks/usePrivatePreviewMode.ts": "Manages private preview mode state via URL hash parameter (#caffeinePrivatePreview=true/disable), persisting the state in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including manager delegation, site content, grave records, cemetery views, user profiles, and blob management with error handling and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme colors including stone/parchment light theme and navy/gold dark theme with smooth transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with lazy-loaded tabs for grave management, cemetery layout, map view, search, PDF export, site content editing, and manager delegation (boss-only). Uses role-based authorization to conditionally show the managers tab.",
  "frontend/src/pages/PublicPage.tsx": "Public-facing page with hero section, tile navigation, and tabs for grave search and map view. Includes scrollable sections for prayer content and cemetery information loaded from site content API.",
  "frontend/src/utils/authErrors.ts": "Utility functions to detect and classify backend authorization errors (boss-lock, manager-lock, general auth failures) and distinguish them from connectivity/network issues.",
  "frontend/src/utils/graveFullTextSearch.ts": "In-memory full-text search utilities for grave records with separate functions for admin mode (searches all fields including owner data) and public mode (searches only deceased names and year of death).",
  "frontend/src/utils/graveStatusStyles.ts": "Shared styling utilities for grave status visualization, providing consistent colors, hover effects, and badge variants for paid, unpaid, reserved, and free grave statuses across light and dark themes.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing and session storage utilities supporting both regular query strings and hash-based routing, with functions to persist parameters across navigation and securely clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space (including sidebar, tile, and chart colors), extends container settings, border radius variables, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata for Cemetery Manager application tracking a fix request to remove duplicate close button (X) from the GraveDetailCard modal, with one pending feature request (AR-1) and one existing feature addressing the same issue."
}