{
  "backend/main.mo": "Defines cemetery data models, public view types, site content structures, and comparison utilities for grave and person records.",
  "feature_evidence.json": "Describes feature evidence linking tooltip readability improvements to specific frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for documentation or build planning.",
  "frontend/index.css": "Sets global Tailwind CSS variables for light and dark themes and applies base styling to elements.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application wrapper handling authentication, theme, routing between public and admin views, and global providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-denied message for non-admin users with a logout option.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Interactive map component that displays cemetery alleys and graves, allows selecting a grave, and opens an edit dialog.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "UI for managing cemetery layout, enabling adding and removing alleys and graves with confirmation dialogs.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing grave records, including status, payment, deceased persons, and owner details.",
  "frontend/src/components/admin/GraveManagement.tsx": "Grave listing and search interface with pagination, filtering, and creation of new graves.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for image loading, data URL conversion, and resizing images to a max size returning a Uint8Array.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Image upload and editing component that previews, resizes, and saves images with progress tracking.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a PDF of cemetery records by assembling HTML from graves and cemetery data and triggers download. Includes formatting helpers and loading state.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Provides an admin interface to edit site content including hero, footer, prayer, and cemetery sections with image uploads and save handlers.",
  "frontend/src/components/ConnectionStatus.tsx": "Shows backend connection status with retry functionality and alerts for disconnected states.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating login button for unauthenticated users using Internet Identity authentication.",
  "frontend/src/components/Footer.tsx": "Footer that loads backend-managed site contact info with fallback data and error messaging.",
  "frontend/src/components/GraveResultsList.tsx": "Displays paginated grave search results for admins and public users with status badges, edit dialog support, and load‑more functionality.",
  "frontend/src/components/GraveSearch.tsx": "Implements admin and public grave search with debounced filtering, full‑text indices, and paginated admin data loading.",
  "frontend/src/components/GraveTileMap.tsx": "Renders the cemetery map using public tile data, including status legends and lazy‑mounted alley grids.",
  "frontend/src/components/Header.tsx": "Shows site header with logo, theme toggle, and logout button using public site content and authentication state.",
  "frontend/src/components/HeroSection.tsx": "Displays configurable hero banner with background image, headline, and fallback loading or error states.",
  "frontend/src/components/LazyMount.tsx": "Mounts children only when near viewport using an in‑view hook to optimize heavy component rendering.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save basic profile information with validation and mutation handling.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Provides four interactive tiles for navigating to map, search, prayer, and about sections.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Shows a warning banner when public site content cannot be loaded, falling back to default messaging.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs periodic backend health checks using the actor and exposes connection status with a manual recheck function.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a debounced version of a value updated after a delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading identities, login/logout, and exposing status via context.",
  "frontend/src/hooks/useInView.ts": "Detects when an element enters the viewport using IntersectionObserver, supporting thresholds and trigger-once behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data with caching, retry logic, error handling, and mutations for various site operations.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, plus global transitions and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin dashboard with tab‑based navigation and lazy‑loaded management components.",
  "frontend/src/pages/PublicPage.tsx": "Implements the public-facing page with tile navigation, search/map tabs, and optional prayer/about sections loaded from site content.",
  "frontend/src/utils/authErrors.ts": "Provides helpers to detect authorization and connectivity errors, including special Boss-lock checks.",
  "frontend/src/utils/graveFullTextSearch.ts": "Implements text normalization and in-memory full‑text search utilities for graves in admin and public modes.",
  "frontend/src/utils/graveStatusStyles.ts": "Maps grave statuses to Tailwind-based colors, labels, and badge variants for consistent UI styling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and removing them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and theme settings with custom variables and plugins.",
  "project_state.json": "Stores project metadata, known issues, feature requests, and current project state for the Cemetery Portal."
}