{
  "backend/main.mo": "Defines cemetery data types and comparison utilities for graves, deceased persons, alleys, and site content in the main Motoko actor.",
  "feature_evidence.json": "Report linking features to files, components, and tests for build 64 deployment and redeploy trigger creation.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files detailing UI behavior, hooks, and components.",
  "frontend/index.css": "Tailwind base file defining CSS variables for light/dark themes and applying global background and border styles.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/publish-live.build64.txt": "Operational marker file indicating build 64 should be published with no functional changes.",
  "frontend/redeploy-trigger.build63.txt": "Trigger file for forcing a redeploy of build 63 without altering application behavior.",
  "frontend/redeploy-trigger.build64.txt": "Build 64 redeploy trigger file used to generate a fresh CI artifact without changing logic.",
  "frontend/src/App.tsx": "Main React app component handling identity, actor initialization, authorization, error states, and route gating with lazy loading.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen notifying unauthorized users and providing a logout action.",
  "frontend/src/components/ActorInitializationErrorScreen.tsx": "Error screen shown when the backend actor fails to initialize, offering retry options.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Admin interactive cemetery map allowing selection of graves for editing with status-based coloring.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Admin interface for adding and removing alleys and graves in the cemetery layout.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing a grave record, including status, owner, and deceased details.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin grave list with search, pagination, and the ability to create new graves via a lazy‑loaded dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading, converting, and resizing images into Uint8Array data.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "React component for selecting, previewing, resizing, and uploading images with progress tracking and removal support.",
  "frontend/src/components/admin/ManagerDelegation.tsx": "Admin UI for the Boss to add or remove manager principals with validation and mutation handling.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a printable PDF summary of cemetery graves using HTML content and parish metadata.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin form for editing site content sections and images including hero, footer, prayers, and cemetery info.",
  "frontend/src/components/ConnectionStatus.tsx": "Displays backend connection health, errors, and retry controls based on health check state.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating login button initiating Internet Identity authentication with simple error handling.",
  "frontend/src/components/Footer.tsx": "Displays parish footer content with contact info, mass times, and bank account copy functionality.",
  "frontend/src/components/GraveResultsList.tsx": "Renders lists of grave search results for admins or public users with load‑more, status badges, and optional editing.",
  "frontend/src/components/GraveSearch.tsx": "Provides grave search with debounced full‑text filtering and separate admin/public data sources.",
  "frontend/src/components/GraveTileMap.tsx": "Displays cemetery layout with status‑colored grave tiles and a legend, using lazy mounting for alleys.",
  "frontend/src/components/Header.tsx": "Shows site logo, parish title, theme toggle, and optional logout button based on authentication.",
  "frontend/src/components/HeroSection.tsx": "Renders homepage hero image, title, scripture quote, and intro text using dynamic site content.",
  "frontend/src/components/LazyMount.tsx": "Mounts heavy child components only when near viewport using intersection observer.",
  "frontend/src/components/PrivatePreviewBanner.tsx": "Shows a banner indicating the app is in private preview mode for internal testing.",
  "frontend/src/components/PrivatePreviewGate.tsx": "Authentication gate showing a login prompt when private preview mode is active and the user is not authenticated.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for entering and saving a user's name and optional email on first use.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Grid of selectable public section tiles that trigger navigation via onSelect.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Alert banner displaying a warning message when site content fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminAuthorization.ts": "Determines whether the authenticated principal is Boss or manager and allowed to access admin features.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Health check hook that pings the backend via the actor and exposes connection status with auto‑retry.",
  "frontend/src/hooks/useDebouncedValue.ts": "Provides a hook that returns a value updated only after a specified debounce delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a context and provider for Internet Identity authentication, exposing identity state and login/logout actions.",
  "frontend/src/hooks/useInView.ts": "Implements an IntersectionObserver-based hook to detect when an element enters the viewport.",
  "frontend/src/hooks/usePrivatePreviewMode.ts": "Tracks private preview mode using URL parameters and session storage to enable or disable the mode.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for data fetching, mutations, and error handling.",
  "frontend/src/index.css": "Sets up Tailwind layers and CSS variables for light/dark themes, layout, and component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin dashboard with tabbed navigation and lazily loaded management tools.",
  "frontend/src/pages/PublicPage.tsx": "Displays the public site with hero content, section tiles, and tabbed access to search and map features.",
  "frontend/src/utils/authErrors.ts": "Provides helpers to detect specific authorization, connectivity, and access-control initialization errors based on message text.",
  "frontend/src/utils/graveFullTextSearch.ts": "Implements normalized text indexing and in‑memory full‑text search for grave records in admin and public modes.",
  "frontend/src/utils/graveStatusStyles.ts": "Maps grave status values to consistent Tailwind styling, labels, legend colors, and badge variants.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, themes, animations, and utilities for the project's design system.",
  "project_state.json": "Describes project metadata, current build state, existing features, and deployment notes."
}