{
  "backend/main.mo": "Defines the actor's data models and comparison helpers for graves, deceased persons, cemetery state, and site content including new public sections.",
  "backend/migration.mo": "Migrates old persistent site content to the new format by adding a default cemeteryInformation section and returning an updated actor state.",
  "feature_evidence.json": "Lists feature evidence mapping features to affected frontend files, components, and test IDs with confidence flags.",
  "frontend-file-summaries.txt": "Provides prewritten high‑level summaries of major frontend files used for build planning.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme color tokens and applying them to base elements.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main React bundle.",
  "frontend/src/App.tsx": "Main app component handling theme, routing, identity, profile setup, and lazy loading of public and admin views.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Shows an interactive cemetery map with grave tiles, status legend, and a dialog for editing selected graves.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Provides UI for managing cemetery layout, allowing admins to add or remove alleys and graves.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing a grave, including fields for status, deceased persons, owner, and payment data.",
  "frontend/src/components/admin/GraveManagement.tsx": "Admin interface for searching, listing, paginating, and creating graves, with lazy‑loaded edit dialog.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading, converting, and resizing images, returning data suitable for uploads.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Handles image upload, validation, preview, resizing, and saving via ExternalBlob with progress tracking.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a cemetery graves PDF by fetching cemetery and grave data, building HTML, and triggering a download with loading state.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Admin UI for editing site content including hero section, footer info, prayer text, and cemetery text with image upload support.",
  "frontend/src/components/ConnectionStatus.tsx": "Shows connection status with loading or error alerts based on actor availability.",
  "frontend/src/components/FloatingLoginControl.tsx": "Floating login button for anonymous users invoking Internet Identity with tooltip and loading guard.",
  "frontend/src/components/Footer.tsx": "Renders the site footer, loading contact data from the backend with fallbacks and displaying address, contact details, office hours, bank info, and a website link.",
  "frontend/src/components/GraveResultsList.tsx": "Displays public or admin grave search results with status badges and optional editing for admins, handling empty states and count display.",
  "frontend/src/components/GraveSearch.tsx": "Provides an in‑memory grave search UI for public and admin modes, loading data, filtering results, and showing counts with pagination for admins.",
  "frontend/src/components/GraveTileMap.tsx": "Renders a tile‑based cemetery map using public tile and layout data, showing status‑colored graves with tooltips and a legend.",
  "frontend/src/components/Header.tsx": "Displays the site header with logo, title, theme toggle, and optional logout, using public site content for a customizable logo.",
  "frontend/src/components/HeroSection.tsx": "Shows a hero banner with a configurable background, title, and introductory text, loading content from the backend with fallbacks and skeletons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal prompting new users to enter and save their profile details, validating input and showing success or error toasts.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Renders a grid of selectable public section tiles with icons that trigger onSelect when clicked.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Displays an alert banner indicating site content failed to load, with an optional custom message.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data with caching, retry logic, error formatting, and mutation helpers.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider before rendering App.",
  "frontend/src/pages/AdminPanel.tsx": "Renders the admin dashboard with tabbed sections that lazy‑load management components like graves, maps, layout, search, exports, and site content.",
  "frontend/src/pages/PublicPage.tsx": "Displays the public-facing page with hero content, section tiles, and lazy‑loaded grave search and map, plus optional prayer and about sections.",
  "frontend/src/utils/graveFullTextSearch.ts": "Provides in‑memory full‑text search utilities for admin and public grave data with different searchable fields.",
  "frontend/src/utils/graveStatusStyles.ts": "Defines consistent styling, labels, and legend colors for different grave statuses.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, containers, animations, and custom CSS variables for the project.",
  "project_state.json": "Defines the project’s schema version, overall system summary, and a list of existing features covering authentication, actor initialization, access control, UX messaging, user profiles, and cemetery state APIs. Serves as a canonical inventory of implemented functionality for planning and tracking."
}