{
  "backend/main.mo": "Defines cemetery data types, site content structures, and comparison helpers within the main backend actor.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining global CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling auth state, lazy-loading pages, theme provider, and profile setup flow.",
  "frontend/src/components/admin/AdminGraveTileMap.tsx": "Renders an interactive cemetery map with grave tiles, status colors, and an edit dialog. Loads graves and layout data, handles tile clicks, and displays legends and loading states.",
  "frontend/src/components/admin/CemeteryLayoutManager.tsx": "Provides UI for adding and removing alleys and graves. Integrates mutation hooks for layout changes and includes confirmation dialogs and loading states.",
  "frontend/src/components/admin/GraveEditDialog.tsx": "Dialog for creating or editing a grave’s details including status, owner, deceased persons, and payment info. Syncs form state with the selected grave and submits updates via mutation hooks.",
  "frontend/src/components/admin/GraveManagement.tsx": "Implements grave browsing and searching with infinite pagination and a creation dialog. Displays search results or paginated lists and manages loading states.",
  "frontend/src/components/admin/imageEditing.ts": "Utility functions for loading, converting, and resizing images, returning resized data as Uint8Array.",
  "frontend/src/components/admin/ImageUploadEditor.tsx": "Handles image selection, preview, validation, resizing, and upload with progress tracking. Allows saving or canceling edits and displays the current image when present.",
  "frontend/src/components/admin/PDFExport.tsx": "Generates a PDF export of cemetery grave records using fetched data and custom HTML styling, with loading state and status formatting.",
  "frontend/src/components/admin/SiteContentManager.tsx": "Provides an admin UI to view and edit site content, handling images, text fields, and saving updates via API.",
  "frontend/src/components/ConnectionStatus.tsx": "Displays connection status messages based on actor availability and loading state.",
  "frontend/src/components/FloatingLoginControl.tsx": "Shows a floating login button for unauthenticated users using Internet Identity.",
  "frontend/src/components/Footer.tsx": "Renders footer with site-managed contact info and fallbacks, including error banner support.",
  "frontend/src/components/GraveResultsList.tsx": "Renders a list of grave search results with different layouts for public and admin users, including status badges and optional editing for admins.",
  "frontend/src/components/GraveSearch.tsx": "Provides search and pagination logic for graves, selecting between admin and public data sources and displaying filtered results.",
  "frontend/src/components/GraveTileMap.tsx": "Displays a cemetery map with grave tiles, using status-based styling and tooltips, along with a legend and alley grouping.",
  "frontend/src/components/Header.tsx": "Shows the site header with theme toggle, logo loading from site content, and logout support when authenticated.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero section with dynamic background, titles, fallback content, and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their profile information with validation and toast feedback.",
  "frontend/src/components/PublicSectionsTiles.tsx": "Displays clickable tiles for selecting public sections like map, search, prayer, and about.",
  "frontend/src/components/SiteContentLoadErrorBanner.tsx": "Shows an alert banner indicating failure to load site content with a customizable message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Custom hook that returns a debounced version of a changing value after a set delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple data-fetching and mutation hooks with caching, retry logic, and domain-specific error handling for backend operations.",
  "frontend/src/index.css": "Tailwind setup defining extensive CSS variables for light and dark themes, including tile and UI color tokens.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and loading global styles.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabbed interface, lazy‑loaded management tools, and component loader handling.",
  "frontend/src/pages/PublicPage.tsx": "Public site page with hero section, selectable tiles, lazy‑loaded search and map, and optional prayer/about sections.",
  "frontend/src/utils/graveFullTextSearch.ts": "Utility building cached normalized text indexes for admin and public grave search.",
  "frontend/src/utils/graveStatusStyles.ts": "Provides style mappings and labels for grave status colors and UI behavior.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins including typography, container queries, and animation utilities.",
  "project_state.json": "Defines the project’s state, including features, new feature requests, metadata, and performance-focused objectives."
}