{
  "kind": "build_request",
  "title": "Improve grave tile hover info contrast on Map tab",
  "projectName": "Cemetery Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Improve the color contrast and overall readability of the hover preview (tooltip) shown when the user hovers a grave tile on the public “Map” tab, so that the grave identification information is clearly visible in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "po otworzeniu zakładki Mapa, po najechaniu kursorem na kafelek grobu niestety jest słaby kontrast i słabo widać informację który to grób - należy poprawić kontrast kolorystyczny wyświetlania podglądu informacji o wybranym grobie po najechaniu na niego kursorem."
        ]
      },
      "acceptanceCriteria": [
        "On the public Map tab, the tooltip content for a hovered grave tile is clearly readable (good contrast) in both light mode and dark mode.",
        "The tooltip’s primary line identifying the grave (e.g., “Grave no. X”) uses a high-contrast text color against the tooltip background.",
        "Secondary tooltip text (e.g., deceased names) is still visually secondary but remains clearly legible (not washed out / low-contrast).",
        "No backend changes are required; only UI styling/markup changes are made."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI components must be composed/used, not edited).",
    "Keep the backend architecture unchanged (single Motoko actor); no schema/state migration is needed for this UI-only change."
  ],
  "nonGoals": [
    "Do not change cemetery map data, layout, alley/grave ordering, or hover behavior timing.",
    "Do not redesign the entire Map page; only address the hover preview/tooltip contrast issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}