{
  "kind": "build_request",
  "title": "Improve overall app performance and speed up grave search",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Improve grave search responsiveness by reducing unnecessary re-filtering and re-rendering during typing in both public and admin search UIs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "czy można jeszcze poprawić szybkość działania aplikacji i szybkość wyszukiwania?"
        ]
      },
      "acceptanceCriteria": [
        "Typing in the grave search input does not trigger a full filter operation on every single keystroke (e.g., input is debounced).",
        "Search results update smoothly for large datasets without noticeable UI jank (no long main-thread stalls during fast typing).",
        "The optimization applies to both public search (frontend/src/components/GraveSearch.tsx) and admin management search (frontend/src/components/admin/GraveManagement.tsx)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Optimize in-memory search implementation by precomputing and reusing normalized searchable strings/fields for graves, instead of normalizing every field for every record on every filter run.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "czy można jeszcze poprawić szybkość działania aplikacji i szybkość wyszukiwania?"
        ]
      },
      "acceptanceCriteria": [
        "Admin in-memory search (searchGravesInMemory) avoids repeated per-field lowercase/trim work for unchanged grave records during subsequent searches.",
        "Public in-memory search (searchPublicGravesInMemory) avoids repeated per-field lowercase/trim work for unchanged public grave records during subsequent searches.",
        "Search result correctness remains the same as before for equivalent queries (case-insensitive, substring matching as currently implemented)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add backend query APIs that support server-side grave searching with pagination so the frontend does not need to load and filter large datasets in memory to search efficiently.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "czy można jeszcze poprawić szybkość działania aplikacji i szybkość wyszukiwania?"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method for public-safe grave search that only returns public-safe fields (equivalent to PublicGraveShape) and supports pagination (limit/pageSize + offset/cursor).",
        "Backend exposes a query method for admin grave search that returns full GraveRecord data and supports pagination (limit/pageSize + offset/cursor).",
        "Search is case-insensitive and supports the same matching semantics currently offered in the UI (substring match across the same fields per mode)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update frontend data-fetching to use the new backend paginated search endpoints when a search query is present, while keeping existing behavior for empty queries (e.g., browsing lists / infinite loading).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "czy można jeszcze poprawić szybkość działania aplikacji i szybkość wyszukiwania?"
        ]
      },
      "acceptanceCriteria": [
        "When the user enters a non-empty query, the UI fetches search results from the backend rather than filtering the entire loaded dataset in memory.",
        "Search results are paginated and can be incrementally loaded (consistent with the existing 'Load more' pattern in admin where applicable).",
        "When the query is cleared, the UI returns to the existing non-search loading mode without requiring a full page refresh.",
        "Public search never requests or displays restricted fields (owner/address/phone/payment)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components must be composed, not modified).",
    "Do not modify any paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts/tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add backend/migration.mo if a state upgrade is required for new indexes/caches."
  ],
  "nonGoals": [
    "Do not add third-party search services or external databases.",
    "Do not add real-time features (WebSockets) or background push updates.",
    "Do not change authorization/role rules as part of this performance work unless strictly required for the new search endpoints."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}