{
  "kind": "build_request",
  "title": "Show grave location and status in search results (alley + plot number)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend public search result shape so public grave search results include grave location (alley and plot/grave number) in addition to the existing deceased name and grave status.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "wyszukiwarka ... po wyszukaniu powinien pokazać imię i nazwisko, status grobu ... oraz która Aleja i który to grób!"
        ]
      },
      "acceptanceCriteria": [
        "The backend candid/types expose a public-search-result type that includes at least: firstName, lastName, status, alley, and plotNumber (or equivalent field names).",
        "The existing public API that returns public graves (used by the public search UI) returns these new location fields for each result.",
        "Existing persisted cemetery/grave data remains unchanged; no state migration is introduced unless strictly required by compilation/upgrade constraints."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the public grave search results UI to display, for each found grave, the deceased person’s first and last name, the grave status (paid/unpaid/reserved/free), and the grave location (alley + grave/plot number).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "po wyszukaniu powinien pokazać imię i nazwisko, status grobu ... oraz która Aleja i który to grób!"
        ]
      },
      "acceptanceCriteria": [
        "In the public search tab, each result card shows: (1) first + last name, (2) a status badge, and (3) a visible location line such as “Alley X, Grave no. Y” (exact wording can follow the app’s current language/style).",
        "The location shown for public results matches the backend-provided alley and plot/grave number fields.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the in-memory search index builder for public graves is updated (if needed) to accommodate the extended public result shape without breaking search filtering or rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Public grave search does not crash after the backend adds location fields to the public result shape.",
        "Search filtering continues to work as before for name/year-based queries."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the admin grave search results UI so each found grave clearly surfaces the same key summary fields at a glance: deceased name (at least one), grave status, and location (alley + plot/grave number).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "po wyszukaniu powinien pokazać imię i nazwisko, status grobu ... oraz która Aleja i który to grób!"
        ]
      },
      "acceptanceCriteria": [
        "In the admin search results list, each result includes a prominent summary showing: location and status, plus at least one deceased person’s first/last name (when available) without requiring scrolling into the detailed “deceased persons” section.",
        "If a grave has zero deceased persons, the UI shows a clear placeholder (e.g., “No deceased persons”) while still showing location and status."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo changes only if a stable-state upgrade truly requires it.",
    "Do not modify files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not introduce external databases or third-party services; use existing in-canister data and APIs."
  ],
  "nonGoals": [
    "Changing the search algorithm/performance characteristics beyond what is necessary to display the requested fields.",
    "Adding new filters, sorting options, or map-based selection as part of this change.",
    "Translating the entire UI to English (only this build request document uses English)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}