{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend performance optimizations for grave search (debounce, indexing, paginated search)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reduce unnecessary re-filtering and re-rendering during typing in public and admin grave search UIs (debounce + smoother rendering).",
      "acceptanceCriteria": [
        "Typing in the grave search input does not trigger a full filter operation on every single keystroke (e.g., input is debounced).",
        "Search results update smoothly for large datasets without noticeable UI jank (no long main-thread stalls during fast typing).",
        "The optimization applies to both public search (frontend/src/components/GraveSearch.tsx) and admin management search (frontend/src/components/admin/GraveManagement.tsx)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDebouncedValue.ts",
          "operation": "create",
          "description": "Add a small React hook for debouncing rapidly changing values (e.g., search input) so expensive search work runs less frequently."
        },
        {
          "path": "frontend/src/components/GraveSearch.tsx",
          "operation": "modify",
          "description": "Debounce the search input state before triggering search computation/rendering; ensure derived lists and counts use the debounced query and avoid unnecessary recomputation for fast typing."
        },
        {
          "path": "frontend/src/components/admin/GraveManagement.tsx",
          "operation": "modify",
          "description": "Debounce the admin searchTerm before triggering in-memory filtering / remote search; ensure the list and counters update from the debounced query to reduce main-thread churn while typing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Optimize in-memory search by precomputing and reusing normalized searchable strings for grave records (public and admin).",
      "acceptanceCriteria": [
        "Admin in-memory search (searchGravesInMemory) avoids repeated per-field lowercase/trim work for unchanged grave records during subsequent searches.",
        "Public in-memory search (searchPublicGravesInMemory) avoids repeated per-field lowercase/trim work for unchanged public grave records during subsequent searches.",
        "Search result correctness remains the same as before for equivalent queries (case-insensitive, substring matching as currently implemented)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/graveFullTextSearch.ts",
          "operation": "modify",
          "description": "Refactor searchGravesInMemory and searchPublicGravesInMemory to reuse precomputed normalized searchable text per record (e.g., cache/index keyed by record identity with change detection) so subsequent searches don't re-normalize every field for every record."
        },
        {
          "path": "frontend/src/components/GraveSearch.tsx",
          "operation": "modify",
          "description": "Update public/admin in-memory search usage to leverage the optimized indexing/caching behavior (e.g., ensure index is created/reused based on the loaded dataset and not rebuilt per keystroke)."
        },
        {
          "path": "frontend/src/components/admin/GraveManagement.tsx",
          "operation": "modify",
          "description": "Update admin in-memory filtering flow to leverage the optimized indexing/caching behavior so filtering does not repeatedly normalize the same unchanged records across searches."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "When a query is present, fetch paginated search results from the backend instead of filtering all loaded data in memory; keep existing browsing behavior for empty queries.",
      "acceptanceCriteria": [
        "When the user enters a non-empty query, the UI fetches search results from the backend rather than filtering the entire loaded dataset in memory.",
        "Search results are paginated and can be incrementally loaded (consistent with the existing 'Load more' pattern in admin where applicable).",
        "When the query is cleared, the UI returns to the existing non-search loading mode without requiring a full page refresh.",
        "Public search never requests or displays restricted fields (owner/address/phone/payment)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query infinite hooks for paginated grave searching (admin + public) that call the existing backendInterface paginated search functions; include queryKey design that isolates results per query and supports incremental loading."
        },
        {
          "path": "frontend/src/components/GraveSearch.tsx",
          "operation": "modify",
          "description": "Switch public search behavior: for non-empty debounced query, use the new public paginated search hook and render only those results; for empty query, keep existing non-search behavior; ensure only public-safe results are requested/displayed."
        },
        {
          "path": "frontend/src/components/admin/GraveManagement.tsx",
          "operation": "modify",
          "description": "Switch admin management search behavior: for non-empty debounced query, use the new admin paginated search hook with 'Load more'; for empty query, keep existing paginated browsing list; ensure clearing the query resets to browse mode without refresh."
        }
      ]
    }
  ]
}