{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show grave location and status in search results (public + admin)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the public grave search results UI to display name, status, and location (alley + plot/grave number) per result.",
      "acceptanceCriteria": [
        "In the public search tab, each result card shows: (1) first + last name, (2) a status badge, and (3) a visible location line such as “Aleja X, Grób nr Y” (wording consistent with the app’s language/style).",
        "The location shown for public results matches the backend-provided alley and plot/grave number fields.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GraveResultsList.tsx",
          "operation": "modify",
          "description": "Extend the public-results card rendering to show a dedicated location line (alley + plot/grave number) using the backend-provided fields when present, while preserving existing name/status display."
        },
        {
          "path": "frontend/src/components/GraveSearch.tsx",
          "operation": "modify",
          "description": "Switch the public search data source from the older public grave shape to the location-enabled public results (as exposed by the backend interface), and pass the updated results into GraveResultsList for rendering."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or update a public query hook to load the location-enabled public grave results (via existing backend capability), and expose a stable return type for the public search UI."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the public in-memory search index builder to tolerate the extended public result shape without breaking filtering or rendering.",
      "acceptanceCriteria": [
        "Public grave search does not crash after the backend adds location fields to the public result shape.",
        "Search filtering continues to work as before for name/year-based queries."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/graveFullTextSearch.ts",
          "operation": "modify",
          "description": "Update public-search indexing helpers to accept the extended public result shape (including optional location fields) without requiring location fields for filtering; keep name/year search behavior unchanged."
        },
        {
          "path": "frontend/src/components/GraveSearch.tsx",
          "operation": "modify",
          "description": "Adjust public search index memoization/typing to align with the updated public results shape so filtering remains stable and does not throw when additional fields are present."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the admin grave search results UI to prominently show deceased summary, status, and location at a glance (with a placeholder if no deceased persons).",
      "acceptanceCriteria": [
        "In the admin search results list, each result includes a prominent summary showing: location and status, plus at least one deceased person’s first/last name (when available) without requiring scrolling into the detailed “deceased persons” section.",
        "If a grave has zero deceased persons, the UI shows a clear placeholder (e.g., “No deceased persons”) while still showing location and status."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GraveResultsList.tsx",
          "operation": "modify",
          "description": "Enhance the admin result card header/summary to include at least one deceased person’s name when available, and render an explicit placeholder when deceasedPersons is empty, while keeping location and status prominent."
        }
      ]
    }
  ]
}